# Concatenación de dataframes

Concatenar = junta, unir o fusionar 

Para dataframes, existen 3 formas de concatenar:
- Concat (concatenar)
- Merge (fusionar)
- Join (unir)

# Concat

Esta técnica básicamente se centra en bases de datos comunes, ie tienen las mismas columnas y por tanto básicamente hay que juntar las filas

In [1]:
import pandas as pd

In [10]:
df1 = pd.DataFrame( {'A': ['1A', '2A'], 'B': ['1B', '2B'], 'C': ['1C', '2C'],  'K':['1k', '2k']} )
df2 = pd.DataFrame( {'A': ['6A', '7A', '8A'], 'B': ['6B', '7B', '8B'], 'C': ['6C', '7C', '8C']} )

In [11]:
pd.concat([df1, df2], ignore_index=True)

    A   B   C    K
0  1A  1B  1C   1k
1  2A  2B  2C   2k
2  6A  6B  6C  NaN
3  7A  7B  7C  NaN
4  8A  8B  8C  NaN

# Merge (fusionar)

Esta técnica fusiona diferentes dataframes a partir de una columna (clave) en común

In [26]:
df1 = pd.DataFrame( {'A': ['1A', '2A', '3A'], 'B': ['1B', '2B', '3B']} )
df2 = pd.DataFrame( {'A': ['5A', '6A'], 'C': ['1C', '2C'],  'K':['1k', '2k']} )

In [30]:
pd.merge(df1, df2, on=['A'], how='left')

    A   B    C    K
0  1A  1B  NaN  NaN
1  2A  2B  NaN  NaN
2  3A  3B  NaN  NaN

# Join

La idea de este dataframe es combinas las columnas de dos dataframes indexados

In [50]:
df1 = pd.DataFrame( {'Z': ['1A', '2A', '3A'], 'B': ['1B', '2B', '3B']}, index=['i1', 'i2', 'i3'] )
df2 = pd.DataFrame( {'A': ['5A', '6A'], 'C': ['1C', '2C'],  'K':['1k', '2k']}, index=['i1', 'i2'] )

In [51]:
df1.join(df2)

     Z   B    A    C    K
i1  1A  1B   5A   1C   1k
i2  2A  2B   6A   2C   2k
i3  3A  3B  NaN  NaN  NaN

# Entradas y salidas

In [53]:
df3 = df1.join(df2)
df3

     Z   B    A    C    K
i1  1A  1B   5A   1C   1k
i2  2A  2B   6A   2C   2k
i3  3A  3B  NaN  NaN  NaN

In [55]:
df3.to_csv('nombre.csv', index=False)

In [57]:
pd.read_csv(r"C:\Users\OMEN CI7\Documents\repository\Neurociencias-2026-1\afuera.csv")

    Z   B    A    C    K
0  1A  1B   5A   1C   1k
1  2A  2B   6A   2C   2k
2  3A  3B  NaN  NaN  NaN

In [ ]:
pd.read_